import os

from django.test import TestCase

from texts.utils.parse_layout_data import parse_layout_data

test_layout_data = """[༢༩བ]༄༅། །དབུ་མ་རྩ་བའི་འགྲེལ་པ་ག་ལས་འཇིགས་མེད།༄༅༅། །རྒྱ་གར་སྐད་དུ། མཱུལ་མདྷྱ་མི་ཀབྲྀཏྟི་ཨ་ཀུ་ཏོ་བྷ་ཡ། བོད་སྐད་དུ། དབུ་མ་རྩ་བའི་འགྲེལ་པ་ག་ལས་འཇིགས་མེད།བམ་པོ་དང་པོ། དཀོན་མཆོག་གསུམ་ལ་ཕྱག་འཚལ་ལོ། །འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་ཕྱག་འཚལ་ལོ། །སློབ་དཔོན་
འཕགས་པ་ཀླུ་སྒྲུབ་ལ་ཕྱག་འཚལ་ལོ། །གང་གིས་སྐྱེ་དང་འཇིག་པ་དག །འདི་ཡི་ཚུལ་གྱིས་རབ་སྤངས་པ། །རྟེན་ཅིང་འབྲེལ་འབྱུང་གསུང་བ་ཡི། །ཐུབ་དབང་དེ་ལ་ཕྱག་འཚལ་ལོ། །གང་གིས་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་། །འགག་པ་མེད་པ་སྐྱེ་མེད་པ། །ཆད་པ་མེད་
པ་རྟག་མེད་པ། །འོང་བ་མེད་པ་འགྲོ་མེད་པ། །ཐ་དད་དོན་མིན་དོན་གཅིག་མིན། །སྤྲོས་པ་ཉེར་ཞི་ཞི་བསྟན་པ། །རྫོགས་པའི་སངས་རྒྱས་སྨྲ་རྣམས་ཀྱི། །དམ་པ་དེ་ལ་ཕྱག་འཚལ་ལོ། །ཞེས་བྱ་བ་ནི་གང་གིས་གདུལ་བའི་སེམས་ཅན་དབང་ཕྱུག་དང་། སྐྱེས་བུ་དང་། གཉི་
ག་དང་། དུས་དང་། རང་བཞིན་དང་། ངེས་པ་དང་། ངོ་བོ་ཉིད་དང་། འགྱུར་བ་དང་། རྡུལ་ཕྲན་གྱི་རྒྱུས་ལོག་པར་ཞུགས་པ། རྒྱུ་མེད་པ་དང་། རྒྱུ་མི་མཐུན་པ་དང་། ཆད་པ་དང་། རྟག་པར་ལྟ་བ་ལ་མངོན་པར་ཞེན་པ། ཆོས་ཀྱི་སྐུ་མཐོང་བ་ལྐོག་ཏུ་གྱུར་པ། བདག་ཏུ་ལྟ་བ་དེ་དང་དེ་ལ་མངོན་པར་
ཞེན་པ་དེ་དང་དེ་དག་རྒྱུ་མེད་པ་དང་། རྒྱུ་མི་མཐུན་པ་དང་། ཆད་པ་དང་རྟག་པར་ལྟ་བ་དང་རྣམ་པར་བཟློག་པའི་ཕྱིར་དང་། ཆོས་ཀྱི་སྐུ་རྟོགས་པར་བྱ་བའི་ཕྱིར་དང་། བདག་ཏུ་ལྟ་བ་དེ་དང་། དེ་རྣམ་པར་བཟློག་པའི་ཕྱིར་ཤས་ཆེར་ཡོངས་སུ་སྦྱང་བ་བྱས་པ། བློ་རྒྱ་ཆེན་པོ་དང་ལྡན་པ་ཟབ་མོ་བསྟན་
པའི་སྣོད་དུ་གྱུར་པ་རྣམས་ལ་སྔར་སྨོས་པའི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་འགག་པ་མེད་པ། སྐྱེ་བ་མེད་པ། ཆད་པ་མེད་པ། རྟག་པ་མེད་པ། འོང་བ་མེད་པ། འགྲོ་བ་མེད་པ། དོན་ཐ་དད་པ་མ་ཡིན་པ། དོན་གཅིག་མ་ཡིན་པ་སྤྲོས་པ་ཐམས་ཅད་ཉེ་བར་ཞི་བ་ཞི་བར་གྱུར་པ་བསྟན་པ་རྫོགས་པའི་
སངས་རྒྱས་སྨྲ་བ་རྣམས་ཀྱི་དམ་པ་དེ་ལ་ཕྱག་འཚལ་ལོ། །ཞེས་བྱ་བ་ཡིན་ནོ། །དེ་བཞིན་གཤེགས་པའི་བསྟོད་པ་བརྗོད་པ་ཕྱག་འཚལ་བའི་བྱ་བ་ཉེ་བར་གདགས་པ་དང་ལྡན་པ་འདིས་ནི་དོན་དམ་པའི་བདེན་པ་ཡོངས་སུ་བསྟན་པ་ཡིན་ནོ། །དེ་ལ་འགག་པ་མེད་པ་ཞེས་བྱ་བ་ནི་རྟེན་ཅིང་འབྲེལ་བར་
[༣༠ན]འབྱུང་བ་འདི་ལ་འགག་པ་ཡོད་པ་མ་ཡིན་པ་སྟེ། ཅིའི་ཕྱིར་ཞེ་ན། སྐྱེ་བ་མེད་པའི་ཕྱིར་རོ། །སྐྱེ་བ་མེད་པ་ཞེས་བྱ་བ་ནི། འགག་པ་མེད་པའི་ཕྱིར་རོ། །ཆད་པ་མེད་པ་ཞེས་བྱ་བ་ནི་ས་བོན་དང་མྱུ་གུ་ཡིན་ནོ། །རྟག་པ་མེད་པ་ཞེས་བྱ་བ་ནི་ས་བོན་དང་མྱུ་གུའི་ཡུན་གྱི་དངོས་པོ་
བཞིན་ནོ། །འོང་བ་མེད་པ་འགྲོ་བ་མེད་པ་ཞེས་བྱ་བ་ནི་ནམ་མཁའ་བཞིན་ནོ། །ཐ་དད་དོན་མིན་ཞེས་བྱ་བ་ནི། འབྲས་སཱ་ལུའི་འབྲས་བུ་བཞིན་ནོ། །དོན་གཅིག་མིན་ཞེས་བྱ་བ་ནི་འབྲས་སཱ་ལུའི་ས་བོན་བཞིན་ནོ། །ཚིག་ལྷག་མ་རྣམས་ལ་ཡང་དེ་བཞིན་དུ་ཅི་རིགས་པར་ཚིག་སྦྱར་བ་བརྗོད་
པར་བྱའོ། །འདིར་སྨྲས་པ། ཅིའི་ཕྱིར་རྣམ་པ་བརྒྱད་པོ་དེ་དག་འགོག་པར་བྱེད། འདིར་བཤད་པ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་འདི་ཐ་སྙད་ཀྱི་བདེན་པར་བསྟན་པ་ལ། དོན་དམ་པའི་བདེན་པ་ལ་འཇུག་པ་དག་འགག་པ་ལ་སོགས་པའི་ཚིག་རྣམ་པ་བརྒྱད་ཀྱིས་མངོན་པར་ཞེན་པ་དེ་བཟློག་པའི་ཕྱིར།
འགག་པ་མེད་པ་ལ་སོགས་པའི་ཚིག་བརྒྱད་པོ་དག་སྨོས་སོ། །འདིར་སྨྲས་པ། འོ་ན་ཅིའི་ཕྱིར་འགག་པ་མེད་པའི་སྒྲ་སྔར་སྨོས། འདིར་བཤད་པ། འདི་ལྟར་རེ་ཞིག་སྐྱེ་བའི་སྒྲ་སྔར་བརྗོད་པར་ངེས་མོད་ཀྱི། འོན་ཀྱང་ཚིགས་སུ་བཅད་པ་སྦྱར་བའི་དབང་གིས་འགག་པ་མེད་པའི་སྒྲའི་སྦྱོར་བ་
སྔ་བ་ལ་འགལ་བ་མེད་དོ། །ཡང་ན་འགག་པ་ཞེས་བྱ་བའི་མིང་ལ་དངོས་པོར་མངོན་པར་ཞེན་པ་རྣམས་ཀྱི་མངོན་པར་ཞེན་པ་དེ་སྤང་པའི་ཕྱིར་ཏེ། བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལས། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། སེམས་འགགས་པ་གང་ཡིན་པ་དེ་ཡང་སྐྱེ་བར་འགྱུར་
རམ། གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མི་འགྱུར་རོ། །བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། སེམས་སྐྱེས་པ་གང་ཡིན་པ་དེ་འགག་པའི་ཆོས་ཅན་ཡིན་ནམ། གསོལ་པ། བཅོམ་ལྡན་འདས་འགག་པའི་ཆོས་ཅན་མ་ལགས་སོ། །བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་
དུ་སེམས། འགག་པའི་ཆོས་ཅན་གང་ཡིན་པ་དེ་འགག་པར་འགྱུར་རམ། གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་མི་འགྱུར་རོ། །བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ཇི་སྙམ་དུ་སེམས། མ་སྐྱེས་པ་གང་ཡིན་པ་དེ་འགག་པའི་ཆོས་ཅན་ཡིན་ནམ། གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །"""


class ParseLayoutDataTests(TestCase):

    def test_parse_layout_data(self):
        page_breaks = parse_layout_data(test_layout_data)
        self.assertEqual(0, page_breaks[0])
        self.assertEqual(1635, page_breaks[1])
        # self.assertEqual(3238, page_breaks[2])

